Xanglu/DIY-Sim-Racing-FFB-Pedal-Odrive/ESP32_master/src/Main.cpp
  #ifndef CONFIG_IDF_TARGET_ESP32S3
    disableCore0WDT();
    disableCore1WDT();
  #endif
  //enable ESP-NOW
  ESPNow_initialize();
  //ESPNow multi-tasking    
  xTaskCreatePinnedToCore(
                        espNowCommunicationTxTask,   
                        "ESPNOW_update_Task", 
                        10000,      
                        NULL,      
                        1,         
                        &taskHandleEepNowTX,    
                        0);     
  delay(500);
  //Serial multitasking
  xTaskCreatePinnedToCore(
                        serialCommunicationRxTask,   
                        "Serial_update_RX_Task", 
                        5000,    
                        NULL,      
                        1,         
                        &taskHandleSerialRX,    
                        1);     
  delay(500);
  xTaskCreatePinnedToCore(
                        serialCommunicationTxTask,   
                        "Serial_update_TX_Task", 
                        5000,     
                        NULL,      
                        1,         
                        &taskHandleSerialTx,    
                        1);     
  delay(500);
  xTaskCreatePinnedToCore(
                        Joystick_Task,   
                        "Joystick_update_Task", 
                        10000,  
                        //STACK_SIZE_FOR_TASK_2,    
                        NULL,      
                        1,         
                        &Task2,    
                        1);     
  delay(500);


  #ifdef Using_MCP4728
    MCP4728_I2C.begin(MCP_SDA,MCP_SCL,400000);
    uint8_t i2c_address[8]={0x60,0x61,0x62,0x63,0x64,0x65,0x66,0x67};
    int index_address=0;
    int found_address=0;
    int error;
    for(index_address=0;index_address<8;index_address++)
    {
      MCP4728_I2C.beginTransmission(i2c_address[index_address]);
      error = MCP4728_I2C.endTransmission();
      if (error == 0)
      {
        Serial.print("I2C device found at address");
        Serial.print(i2c_address[index_address]);
        Serial.println("  !");
        found_address=index_address;
        break;
        
      }
      else
      {
        Serial.print("try address");
        Serial.println(i2c_address[index_address]);
      }
    }
    
    if(mcp.begin(i2c_address[found_address], &MCP4728_I2C)==false)
    {
      Serial.println("Couldn't find MCP4728, will not have analog output");
      MCP_status=false;
    }
    else
    {
      Serial.println("MCP4728 founded");
      MCP_status=true;
      //MCP.begin();
    }
    
  #endif
        
  //initialize time_record
  uint8_t pedalIDX;
  for(pedalIDX=0;pedalIDX<3;pedalIDX++)
  {
    pedal_last_update[pedalIDX]=millis();
  }
  #ifdef LED_ENABLE_WAVESHARE
    pixels.begin();
    pixels.setBrightness(20);
    pixels.setPixelColor(0,0xff,0xff,0xff);
    pixels.show();
    xTaskCreatePinnedToCore(
                          LED_Task,   
                          "LED_update_Task", 
                          3000,  
                          //STACK_SIZE_FOR_TASK_2,    
                          NULL,      
                          1,         
                          &Task3,    
                          0);     
    delay(500);
  #endif
  #ifdef LED_ENABLE_DONGLE
    pixels.begin();
    pixels.setBrightness(20);
    pixels.setPixelColor(0,0xff,0xff,0xff);
    pixels.show();
    xTaskCreatePinnedToCore(
                          LED_Task_Dongle,   
                          "LED_update_Task", 
                          3000,  
                          //STACK_SIZE_FOR_TASK_2,    
                          NULL,      
                          1,         
                          &Task3,    
                          0);     
    delay(500);
  #endif
  #ifdef Fanatec_comunication
    // Initialize FanatecInterface
    fanatec.begin();

    // Set connection callback
    fanatec.onConnected([](bool connected) {        
      if (connected) {
        Serial.println("[L] FANATEC Connected to Wheelbase.");
      } else {
        Serial.println("[L] FANATEC Disconnected from Wheelbase.");
      }
    });
    delay(2000);
    xTaskCreatePinnedToCore(
                          FanatecUpdate,   
                          "Fanatec_update_Task", 
                          3000,  
                          //STACK_SIZE_FOR_TASK_5,    
                          NULL,      
                          1,         
                          &Task5,    
                          1);     
    delay(500);
  #endif

  #ifdef OTA_Update
    xTaskCreatePinnedToCore(
                          OTATask,   
                          "OTA_update_Task", 
                          16000,  
                          //STACK_SIZE_FOR_TASK_5,    
                          NULL,      
                          1,         
                          &Task7,    
                          1);     
    delay(500);
  #endif
  Serial.println("[L]Setup end");
  //initialize wifi 
  for(uint i=0;i<30;i++)
  {
    dap_action_ota_st.payloadOtaInfo_.WIFI_PASS[i]=0;
    dap_action_ota_st.payloadOtaInfo_.WIFI_SSID[i]=0;
  }
  
  
}

//espnow communication task
uint32_t loop_count=0;
bool basic_rssi_update=false;
unsigned long bridge_state_last_update=millis();
unsigned long Pairing_state_start;
unsigned long Pairing_state_last_sending;
uint8_t press_count=0;
uint Pairing_timeout=20000;
bool Pairing_timeout_status=false;
bool building_dap_esppairing_lcl =false;
void loop() 
{
  taskYIELD();
  delay(10000);
}

void espNowCommunicationTxTask( void * pvParameters )
{
  for(;;)
  {
    #ifdef ESPNow_Pairing_function
      if(digitalRead(Pairing_GPIO)==LOW||software_pairing_action_b)
      {
        Serial.println("[L]Bridge Pairing.....");
        delay(1000);
        Pairing_state_start=millis();
        Pairing_state_last_sending=millis();
        ESPNow_pairing_action_b=true;
        building_dap_esppairing_lcl=true;
        LED_Status=1;
        software_pairing_action_b=false;
      }
      if(ESPNow_pairing_action_b)
      {
        unsigned long now=millis();
        //sending package
        if(building_dap_esppairing_lcl)
        {
          uint16_t crc=0;          
          building_dap_esppairing_lcl=false;
          dap_esppairing_lcl.payloadESPNowInfo_._deviceID=deviceID;
          dap_esppairing_lcl.payLoadHeader_.payloadType=DAP_PAYLOAD_TYPE_ESPNOW_PAIRING;
          dap_esppairing_lcl.payLoadHeader_.PedalTag=deviceID;
          dap_esppairing_lcl.payLoadHeader_.version=DAP_VERSION_CONFIG;
          crc = checksumCalculator((uint8_t*)(&(dap_esppairing_lcl.payLoadHeader_)), sizeof(dap_esppairing_lcl.payLoadHeader_) + sizeof(dap_esppairing_lcl.payloadESPNowInfo_));
          dap_esppairing_lcl.payloadFooter_.checkSum=crc;
        }
        if(now-Pairing_state_last_sending>400)
        {
          Pairing_state_last_sending=now;
          ESPNow.send_message(broadcast_mac,(uint8_t *) &dap_esppairing_lcl, sizeof(dap_esppairing_lcl));
        }
        

        //timeout check
        if(now-Pairing_state_start>Pairing_timeout)
        {
          Serial.println("[L]Bridge Pairing timeout!");
          ESPNow_pairing_action_b=false;
          LED_Status=0;
          if(UpdatePairingToEeprom)
          {
            EEPROM.put(EEPROM_offset,_ESP_pairing_reg);
            EEPROM.commit();
            UpdatePairingToEeprom=false;
            
            //list eeprom
            ESP_pairing_reg ESP_pairing_reg_local;
            EEPROM.get(EEPROM_offset, ESP_pairing_reg_local);
            for(int i=0;i<4;i++)
            {
              if(ESP_pairing_reg_local.Pair_status[i]==1)
              {                
                Serial.print("[L]#");
                Serial.print(i);
                Serial.print("Pair: ");
                Serial.print(ESP_pairing_reg_local.Pair_status[i]);
                Serial.printf(" Mac: %02X:%02X:%02X:%02X:%02X:%02X", ESP_pairing_reg_local.Pair_mac[i][0], ESP_pairing_reg_local.Pair_mac[i][1], ESP_pairing_reg_local.Pair_mac[i][2], ESP_pairing_reg_local.Pair_mac[i][3], ESP_pairing_reg_local.Pair_mac[i][4], ESP_pairing_reg_local.Pair_mac[i][5]);
                Serial.println("");
              }
              Serial.println("");
            }
            Serial.println("");
            //adding peer
            /*
            for(int i=0; i<4;i++)
            {
              if(_ESP_pairing_reg.Pair_status[i]==1)
              {
                if(i==0)
                {
                  ESPNow.remove_peer(Clu_mac);
                  memcpy(&Clu_mac,&_ESP_pairing_reg.Pair_mac[i],6);
                  delay(300);
                  ESPNow.add_peer(Clu_mac);
                  
