Xanglu/DIY-Sim-Racing-FFB-Pedal-Odrive/ESP32_master/src/Main.cpp
                }
                if(i==1)
                {
                  ESPNow.remove_peer(Brk_mac);
                  memcpy(&Brk_mac,&_ESP_pairing_reg.Pair_mac[i],6);
                  delay(300);
                  ESPNow.add_peer(Brk_mac);
                  //Serial.printf("[L]Mac: %02X:%02X:%02X:%02X:%02X:%02X\n", Brk_mac[0], Brk_mac[1], Brk_mac[2], Brk_mac[3], Brk_mac[4], Brk_mac[5]);

                }
                if(i==2)
                {
                  ESPNow.remove_peer(Gas_mac);
                  memcpy(&Gas_mac,&_ESP_pairing_reg.Pair_mac[i],6);
                  delay(300);
                  ESPNow.add_peer(Gas_mac);
                }        
                if(i==3)
                {
                  ESPNow.remove_peer(esp_Host);
                  memcpy(&esp_Host,&_ESP_pairing_reg.Pair_mac[i],6);
                  delay(300);
                  ESPNow.add_peer(esp_Host);                
                }        
              }
            }
            */
          }
          
        }
      }
    #endif
    for(int i=0;i<3;i++)
    {
      if(configUpdateAvailable[i])
      {
        configUpdateAvailable[i] = false;
        if(dap_bridge_state_st.payloadBridgeState_.Pedal_availability[i]==1)
        {
          esp_err_t err;
          switch (i)
          {
            case PEDAL_ID_CLUTCH:
              Serial.print("[L]Sending Clutch config,Result:");
              err = ESPNow.send_message(Clu_mac, (uint8_t *)&dap_config_st[i], sizeof(DAP_config_st));
              break;
            case PEDAL_ID_BRAKE:
              Serial.print("[L]Sending Brake config,Result:");
              err = ESPNow.send_message(Brk_mac, (uint8_t *)&dap_config_st[i], sizeof(DAP_config_st));
              break;
            case PEDAL_ID_THROTTLE:
              Serial.print("[L]Sending Throttle config,Result:");
              err = ESPNow.send_message(Gas_mac, (uint8_t *)&dap_config_st[i], sizeof(DAP_config_st));
              break;
            default:
              break;
          }
          Serial.println(esp_err_to_name(err));
        }
      }
    }
    

    for(int i=0; i<3; i++)
    {
      if(dap_action_update[i] )
      {
        dap_action_update[i]=false;
        if(dap_bridge_state_st.payloadBridgeState_.Pedal_availability[i]==1)
        {
          switch (i)
          {
            case PEDAL_ID_CLUTCH:
              ESPNow.send_message(Clu_mac,(uint8_t *) &dap_actions_st[i],sizeof(DAP_actions_st));
              break;
            case PEDAL_ID_BRAKE:
              ESPNow.send_message(Brk_mac,(uint8_t *) &dap_actions_st[i],sizeof(DAP_actions_st));
              break;
            case PEDAL_ID_THROTTLE:
              ESPNow.send_message(Gas_mac,(uint8_t *) &dap_actions_st[i],sizeof(DAP_actions_st));
              break;
            default:
              break;
          }
        }
      }
    }
   
    //forward the basic wifi info for pedals
    if(pedal_OTA_action_b)
    {
      switch(dap_action_ota_st.payloadOtaInfo_.device_ID)
      {
        case 0:
          ESPNow.send_message(Clu_mac,(uint8_t *) &dap_action_ota_st,sizeof(DAP_action_ota_st));
          Serial.println("[L]Forward OTA command to Clutch");
        break;
        case 1:
          ESPNow.send_message(Brk_mac,(uint8_t *) &dap_action_ota_st,sizeof(DAP_action_ota_st));
          Serial.println("[L]Forward OTA command to Brake");
        break;
        case 2:
          ESPNow.send_message(Gas_mac,(uint8_t *) &dap_action_ota_st,sizeof(DAP_action_ota_st));
          Serial.println("[L]Forward OTA command to Throttle");
        break;
      }
      pedal_OTA_action_b=false;
    }

    delay(2);
  }
}


//serial communication recieve task
bool PedalUpdateIntervalPrint_b=false;
unsigned long PedalUpdateLast=0;
unsigned long UARTJoystickUpdateLast=0;
bool PedalUpdateIntervalPrint_trigger=false;
bool UARTJoystickUpdate_b=false;
int joystick_fake_value=0;

typedef struct {
    uint16_t startBytePos_u16;
    uint16_t endBytePos_u16;
    uint16_t payloadType_u16;
    bool validFlag_b;
} structChecker_st;

// Helper function to determine expected packet size from payload type
// Returns 0 if the payload type is unknown.
static inline size_t getExpectedPacketSize(uint8_t payloadType) {
    switch (payloadType) {
        case DAP_PAYLOAD_TYPE_CONFIG:
            return sizeof(DAP_config_st);
        case DAP_PAYLOAD_TYPE_ACTION:
            return sizeof(DAP_actions_st);
        case DAP_PAYLOAD_TYPE_ACTION_OTA:
            return sizeof(DAP_action_ota_st);
        case DAP_PAYLOAD_TYPE_BRIDGE_STATE:
            return sizeof(DAP_bridge_state_st);
        // Add other packet types here in the future
        default:
            return 0;
    }
}
void serialCommunicationRxTask( void * pvParameters)
{
  // Buffer to accumulate incoming serial data
  const size_t RX_BUFFER_SIZE = 1028; // Should be at least 2x the largest possible packet
  static uint8_t rx_buffer[RX_BUFFER_SIZE];
  static size_t buffer_len = 0;
  //configDataPackage_t configPackage_st;
  for(;;)
  {
    // --- 1. Read all available data into our buffer ---
    if (Serial.available())
    {
      // Prevent buffer overflow by only reading what fits
      size_t bytesToRead = min((size_t)Serial.available(), RX_BUFFER_SIZE - buffer_len);
      if (bytesToRead > 0)
      {
        Serial.readBytes(&rx_buffer[buffer_len], bytesToRead);
        buffer_len += bytesToRead;
      }

      // Serial.println("Serial data available");
    }

    // --- 2. Process all complete packets in the buffer ---
    size_t buffer_idx = 0;
    while (buffer_idx < buffer_len)
    {
      // A. Find the next valid Start-of-Frame (SOF)
      if (rx_buffer[buffer_idx] != SOF_BYTE_0 || (buffer_idx + 1 < buffer_len && rx_buffer[buffer_idx + 1] != SOF_BYTE_1))
      {
        buffer_idx++;
        continue; // Keep scanning for a SOF
      }

      // Serial.println("1st check passed");

      // SOF found at buffer_idx. Check if we have enough data for a header.
      if (buffer_len < buffer_idx + 3)
      {
        // Not enough data for a full header, stop parsing for now
        break;
      }

      // B. Get expected packet size from payload type
      uint8_t payloadType = rx_buffer[buffer_idx + 2];
      size_t expectedSize = getExpectedPacketSize(payloadType);

