Xanglu/DIY-Sim-Racing-FFB-Pedal-Odrive/ESP32_master/src/Main.cpp
      if (expectedSize == 0)
      {
        // Unknown payload type, this SOF is corrupt. Skip it and continue scanning.
        buffer_idx++;
        continue;
      }

      // Serial.println("2nd check passed");

      // C. Check if the full packet has arrived
      if (buffer_len < buffer_idx + expectedSize)
      {
        // Full packet is not yet in the buffer, wait for more data
        break;
      }

      // D. Check for valid End-of-Frame (EOF)
      if (rx_buffer[buffer_idx + expectedSize - 2] != EOF_BYTE_0 || rx_buffer[buffer_idx + expectedSize - 1] != EOF_BYTE_1)
      {
        // EOF is wrong, this packet is corrupt. Skip the SOF and continue scanning.
        buffer_idx++;
        continue;
      }

      // --- We have a candidate packet! Now validate and process it. ---
      uint8_t *packet_start = &rx_buffer[buffer_idx];
      bool structIsValid = true;
      uint16_t received_crc = 0;
      uint16_t calculated_crc = 0;

      switch (payloadType)
      {
        //case config
        case DAP_PAYLOAD_TYPE_CONFIG:
        {
          bool structChecker = true;
          DAP_config_st dap_config_st_local;
          memcpy(&dap_config_st_local, packet_start, sizeof(DAP_config_st));
          //Serial.readBytes((char *)&dap_config_st_local, sizeof(DAP_config_st));
          if (dap_config_st_local.payLoadHeader_.payloadType != DAP_PAYLOAD_TYPE_CONFIG)
          {
            structChecker = false;
            structIsValid=false;
            Serial.print("[L]Payload type expected: ");
            Serial.print(DAP_PAYLOAD_TYPE_CONFIG);
            Serial.print(",   Payload type received: ");
            Serial.println(dap_config_st_local.payLoadHeader_.payloadType);
          }
          if (dap_config_st_local.payLoadHeader_.version != DAP_VERSION_CONFIG)
          {
            structChecker = false;
            structIsValid = false;
            Serial.print("[L]Config version expected: ");
            Serial.print(DAP_VERSION_CONFIG);
            Serial.print(",   Config version received: ");
            Serial.println(dap_config_st_local.payLoadHeader_.version);
          }
          // checksum validation
          uint16_t crc = checksumCalculator((uint8_t *)(&(dap_config_st_local.payLoadHeader_)), sizeof(dap_config_st_local.payLoadHeader_) + sizeof(dap_config_st_local.payLoadPedalConfig_));
          if (crc != dap_config_st_local.payloadFooter_.checkSum)
          {
            structChecker = false;
            structIsValid = false;
            Serial.print("[L]CRC expected: ");
            Serial.print(crc);
            Serial.print(",   CRC received: ");
            Serial.println(dap_config_st_local.payloadFooter_.checkSum);
          }
          // if checks are successfull, overwrite global configuration struct
          if (structChecker == true)
          {
            int pedalIdx = dap_config_st_local.payLoadHeader_.PedalTag;
            // Serial.println("[L]Updating pedal config");
            memcpy(&dap_config_st[pedalIdx], &dap_config_st_local, sizeof(DAP_config_st));
            configUpdateAvailable[pedalIdx] = true;
          }
          break;
        }
        //case action to pedal
        case DAP_PAYLOAD_TYPE_ACTION:
        {
          bool structChecker = true;
          DAP_actions_st dap_actions_st_local;
          memcpy(&dap_actions_st_local, packet_start, sizeof(DAP_actions_st));
          //memcpy(&dap_actions_st_local, packet_start, sizeof(DAP_config_st));
          //Serial.readBytes((char *)&dap_actions_st_local, sizeof(DAP_actions_st));
          if (dap_actions_st_local.payLoadHeader_.payloadType != DAP_PAYLOAD_TYPE_ACTION)
          {
            structChecker = false;
            structIsValid = false;
            Serial.print("[L]Payload type expected: ");
            Serial.print(DAP_PAYLOAD_TYPE_ACTION);
            Serial.print(",   Payload type received: ");
            Serial.println(dap_actions_st_local.payLoadHeader_.payloadType);
          }
          if (dap_actions_st_local.payLoadHeader_.version != DAP_VERSION_CONFIG)
          {
            structChecker = false;
            structIsValid = false;
            Serial.print("[L]Config version expected: ");
            Serial.print(DAP_VERSION_CONFIG);
            Serial.print(",   Config version received: ");
            Serial.println(dap_actions_st_local.payLoadHeader_.version);
          }

          uint16_t crc = checksumCalculator((uint8_t *)(&(dap_actions_st_local.payLoadHeader_)), sizeof(dap_actions_st_local.payLoadHeader_) + sizeof(dap_actions_st_local.payloadPedalAction_));
          if (crc != dap_actions_st_local.payloadFooter_.checkSum)
          {
            structChecker = false;
            structIsValid = false;
            Serial.print("[L]CRC expected: ");
            Serial.print(crc);
            Serial.print(",   CRC received: ");
            Serial.println(dap_actions_st_local.payloadFooter_.checkSum);
          }
          if (structChecker == true)
          {
            int pedalIdx = dap_actions_st_local.payLoadHeader_.PedalTag;
            memcpy(&dap_actions_st[pedalIdx], &dap_actions_st_local, sizeof(DAP_actions_st));
            dap_action_update[pedalIdx] = true;
          }
          break;
        }

        //case action for ota
        case DAP_PAYLOAD_TYPE_ACTION_OTA:
        {
          Serial.println("[L]get OTA command and its info");
          memcpy(&dap_action_ota_st, packet_start, sizeof(DAP_action_ota_st));
          //Serial.readBytes((char *)&dap_action_ota_st, sizeof(DAP_action_ota_st));
          #ifdef OTA_Update
            bool structChecker_b = true;
            if (dap_action_ota_st.payLoadHeader_.payloadType != DAP_PAYLOAD_TYPE_ACTION_OTA)
            {
              structChecker_b = false;
              structIsValid = false;
            }
            if (structChecker_b)
            {
              SSID = new char[dap_action_ota_st.payloadOtaInfo_.SSID_Length + 1];
              PASS = new char[dap_action_ota_st.payloadOtaInfo_.PASS_Length + 1];
              memcpy(SSID, dap_action_ota_st.payloadOtaInfo_.WIFI_SSID, dap_action_ota_st.payloadOtaInfo_.SSID_Length);
              memcpy(PASS, dap_action_ota_st.payloadOtaInfo_.WIFI_PASS, dap_action_ota_st.payloadOtaInfo_.PASS_Length);
              SSID[dap_action_ota_st.payloadOtaInfo_.SSID_Length] = 0;
              PASS[dap_action_ota_st.payloadOtaInfo_.PASS_Length] = 0;
              /*
              Serial.printf("[L]Device ID:%d\n",dap_action_ota_st.payloadOtaInfo_.device_ID);
              Serial.print("[L]SSID(uint)=");
              for(uint i=0; i<dap_action_ota_st.payloadOtaInfo_.SSID_Length;i++)
              {
                Serial.print(dap_action_ota_st.payloadOtaInfo_.WIFI_SSID[i]);
                Serial.print(",");
              }
              Serial.println(" ");
              Serial.print("[L]PASS(uint)=");
              for(uint i=0; i<dap_action_ota_st.payloadOtaInfo_.PASS_Length;i++)
              {
                Serial.print(dap_action_ota_st.payloadOtaInfo_.WIFI_PASS[i]);
                Serial.print(",");
              }
              Serial.println(" ");

