Xanglu/DIY-Sim-Racing-FFB-Pedal-Odrive/ESP32_master/src/Main.cpp
              Serial.print("[L]SSID=");
              Serial.println(SSID);
              Serial.print("[L]PASS=");
              Serial.println(PASS);
              */
            }

            if (dap_action_ota_st.payloadOtaInfo_.device_ID == deviceID && structChecker_b == true)
            {
              OTA_enable_b = true;
              Serial.println("[L] Bridge OTA begin.");
            }
            else if (structChecker_b)
            {
              pedal_OTA_action_b = true;
            }
          #endif
          break;
        }
        case DAP_PAYLOAD_TYPE_BRIDGE_STATE:
        {
          bool structChecker = true;
          DAP_bridge_state_st dap_bridge_state_local;
          //dap_bridge_state_local_ptr = &dap_bridge_state_lcl;
          memcpy(&dap_bridge_state_local, packet_start, sizeof(DAP_bridge_state_st));
          //Serial.readBytes((char *)dap_bridge_state_local_ptr, sizeof(DAP_bridge_state_st));
          // check if data is plausible
          if (dap_bridge_state_local.payLoadHeader_.payloadType != DAP_PAYLOAD_TYPE_BRIDGE_STATE)
          {
            structChecker = false;
            structIsValid = false;
            Serial.print("[L]Payload type expected: ");
            Serial.print(DAP_PAYLOAD_TYPE_BRIDGE_STATE);
            Serial.print(",   Payload type received: ");
            Serial.println(dap_bridge_state_local.payLoadHeader_.payloadType);
          }
          if (dap_bridge_state_local.payLoadHeader_.version != DAP_VERSION_CONFIG)
          {
            structChecker = false;
            structIsValid = false;
            Serial.print("[L]Config version expected: ");
            Serial.print(DAP_VERSION_CONFIG);
            Serial.print(",   Config version received: ");
            Serial.println(dap_bridge_state_lcl.payLoadHeader_.version);
          }
          // checksum validation
          uint16_t crc = checksumCalculator((uint8_t *)(&(dap_bridge_state_local.payLoadHeader_)), sizeof(dap_bridge_state_local.payLoadHeader_) + sizeof(dap_bridge_state_local.payloadBridgeState_));
          if (crc != dap_bridge_state_local.payloadFooter_.checkSum)
          {
            structChecker = false;
            structIsValid = false;
            Serial.print("[L]CRC expected: ");
            Serial.print(crc);
            Serial.print(",   CRC received: ");
            Serial.println(dap_bridge_state_local.payloadFooter_.checkSum);
          }
          // if checks are successfull, overwrite global configuration struct
          if (structChecker == true)
          {
            memcpy(&dap_bridge_state_lcl, &dap_bridge_state_local, sizeof(DAP_bridge_state_st));
            if (dap_bridge_state_lcl.payloadBridgeState_.Bridge_action == BRIDGE_ACTION_ENABLE_PAIRING)
            {
              #ifdef ESPNow_Pairing_function
                Serial.println("[L]Bridge Pairing...");
                software_pairing_action_b = true;
              #endif
              #ifndef ESPNow_Pairing_function
                Serial.println("[L]Pairing command didn't supported");
              #endif
            }
            // action=2, restart
            if (dap_bridge_state_lcl.payloadBridgeState_.Bridge_action == BRIDGE_ACTION_RESTART)
            {
              Serial.println("[L]Bridge Restart");
              delay(1000);
              ESP.restart();
            }
            if (dap_bridge_state_lcl.payloadBridgeState_.Bridge_action == BRIDGE_ACTION_DOWNLOAD_MODE)
            {
              // aciton=3 restart into boot mode
              #ifdef Using_Board_ESP32S3
                Serial.println("[L]Bridge Restart into Download mode");
                delay(1000);
                REG_WRITE(RTC_CNTL_OPTION1_REG, RTC_CNTL_FORCE_DOWNLOAD_BOOT);
                ESP.restart();
              #endif
              #ifdef Using_Board_ESP32
                Serial.println("[L]Command not supported ");
                delay(1000);
              #endif
            }
            if (dap_bridge_state_lcl.payloadBridgeState_.Bridge_action == BRIDGE_ACTION_DEBUG)
            {
              if (PedalUpdateIntervalPrint_trigger)
              {
                // aciton=4 print pedal update interval
                Serial.println("[L]Bridge debug mode off.");
                PedalUpdateIntervalPrint_trigger = false;
              }
              else
              {
                // aciton=4 print pedal update interval
                Serial.println("[L]Bridge debug mode on.");
                PedalUpdateIntervalPrint_trigger = true;
              }
            }
            if (dap_bridge_state_lcl.payloadBridgeState_.Bridge_action == BRIDGE_ACTION_JOYSTICK_FLASHING_MODE)
            {
              #ifdef External_RP2040
                Serial.println("[L]JOYSTICK restart into flashing mode");
                dap_joystickUART_state_lcl._payloadjoystick.JoystickAction = JOYSTICKACTION_RESET_INTO_BOOTLOADER;
              #else
                Serial.println("[L]The command is not supported");
              #endif
            }
            if (dap_bridge_state_lcl.payloadBridgeState_.Bridge_action == BRIDGE_ACTION_JOYSTICK_DEBUG)
            {
              #ifdef External_RP2040
                Serial.println("[L]JOYSTICK debug mode on");
                dap_joystickUART_state_lcl._payloadjoystick.JoystickAction = JOYSTICKACTION_DEBUG_MODE;
              #else
                Serial.println("[L]The command is not supported");
              #endif
            }
          }
          break;
        }
        default:
        {
          Serial.println("[L]Unknown payload type");
          break;
        }
      }//switch end
      if (!structIsValid)
      {
        Serial.printf("Invalid packet detected (Type: %d). Skipping SOF.\n", payloadType);
        buffer_idx++; // Skip the failed SOF and continue scanning
      }
      else
      {
        // Packet was valid and processed, advance index past this packet
        buffer_idx += expectedSize;
      }
    }//while end
    // --- 3. Clean up the buffer ---
    if (buffer_idx > 0)
    {
      size_t remaining_len = buffer_len - buffer_idx;
      if (remaining_len > 0)
      {
        memmove(rx_buffer, &rx_buffer[buffer_idx], remaining_len);
      }
      buffer_len = remaining_len;
    }
  }
}


void serialCommunicationTxTask( void * pvParameters)
{
  for(;;)
  {  
    uint16_t crc;
    unsigned long current_time=millis();
    if(current_time-bridge_state_last_update>200)
    {
      basic_rssi_update=true;
      bridge_state_last_update=millis();
    }
    if(current_time-PedalUpdateLast>500)
    {
      PedalUpdateIntervalPrint_b=true;
      PedalUpdateLast=current_time;
    }
    if(current_time-UARTJoystickUpdateLast>7)
    {
      UARTJoystickUpdate_b=true;
      UARTJoystickUpdateLast=current_time;
    }
    bool structChecker = true;

    for(int i =0; i<3; i++)
    {
      if(update_basic_state[i])
      {
        update_basic_state[i]=false;
        Serial.write((char*)&dap_state_basic_st[i], sizeof(DAP_state_basic_st));
        Serial.print("\r\n");
        if(dap_bridge_state_st.payloadBridgeState_.Pedal_availability[dap_state_basic_st[i].payLoadHeader_.PedalTag]==0)
        {
          Serial.print("[L]Found Pedal:");
          Serial.println(dap_state_basic_st[i].payLoadHeader_.PedalTag);
        }
        dap_bridge_state_st.payloadBridgeState_.Pedal_availability[dap_state_basic_st[i].payLoadHeader_.PedalTag]=1;
        pedal_last_update[dap_state_basic_st[i].payLoadHeader_.PedalTag]=millis();
        if(ESPNow_error_b[i])
        {
          Serial.print("[L]Pedal:");
          Serial.print(dap_state_basic_st[i].payLoadHeader_.PedalTag);
          Serial.print(" E:");
          Serial.println(dap_state_basic_st[i].payloadPedalState_Basic_.error_code_u8);
          ESPNow_error_b[i]=false;    
        }
      }
      if(update_extend_state[i])
      {
        update_extend_state[i]=false;
        Serial.write((char*)&dap_state_extended_st[i], sizeof(DAP_state_extended_st));
        Serial.print("\r\n");

